<?php
/*------------------------ 1 ------------------------*/
/* с помощью while вывести от 1 до 100, которые делятся на 3 без остатка*/
echo 'Task 1:<br />';
$a = 1;
while ($a<=100) {
if ($a%3==0) {
	echo ' '.$a;
}
$a++;
}

/*------------------------ 2 ------------------------*/
/* с помощью do while вывести от 0 до 10 четных и нечетных чисел*/
echo '<hr />';
echo 'Task 2:<br />';

$a = 0;
do {
if($a==0) {
		echo '0 - это ноль<br>';
	}
	elseif ($a%2==0) {
		echo $a.' - четное число<br>';
	}
	else {
		echo $a.' - нечетное число<br>';
}
$a++;
}
while ($a<=10);


/*------------------------ 3 ------------------------*/
/* array область - города. Вывести в цикле по названию области ее города*/

echo '<hr />';
echo 'Task 3:<br />';

$region = [];
$s1 = "Московская область";
$str1= "Коломна, Волоколамск, Серпухов";
$region [$s1] = $str1;
$s2 = "Ленинградская область";
$str2="Гатчина, Выборг, Тосно, Ивангород";
$region [$s2] = $str2; 

echo $s1.":".$region [$s1]."<br>";
echo $s2.":".$region [$s2];

/*------------------------ 4 ------------------------*/
/* транслитерация русских и латинских букв через массив */
echo '<hr />';
echo 'Task 4:<br />';

$latter = [];
$cyrillic = ["a","б","ц","д","е","ф","г","х","и","й","к","л","м","н","о","п","у","р","с","т","у","в","ю","х","и","з"];
$latin =    ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"];

for($i=0;$i<count($latin); $i++) {
	$lat=$latin[$i];
	$latter[$lat]=$cyrillic[$i];
}

for($i=0;$i<count($latter); $i++) {
	$lat=$latin[$i];
	echo $lat ." - ".$latter[$lat]."<br>";
}
/*------------------------ 5 ------------------------*/
echo '<hr />';
echo 'Task 5:<br />';

function spaceToUnderscore($s) {
$m = explode(" ",$s);
$s2 = implode("_",$m);
	return $s2;
}
$s="Hello, World !";
echo $s . "<br>";
echo spaceToUnderscore($s);


/*------------------------ 6 ------------------------*/   
echo '<hr />';
echo 'Task 6:<br />';
$n = 10;
$s = "<ul>List:<br>";

for($i=0;$i<$n; $i++) {
	$s = $s . "<li>List element".$i."</li><br>";
}
$s = $s."</ul>";
echo $s;

/*------------------------ 7 ------------------------*/   
echo '<hr />';
echo 'Task 7:<br />';
//for($i=1; (echo $i)<=9 && 1==1; $i++) {
//}
/*---------------------------------------------------*/
echo '<hr />';
$main="PHP1. LESSON 3. HOME WORK";
//var_dump($a == $b); 						//True,неявное приведение '05' к int дает 5 
?>
<!DOCTYPE html>
<head>
	<title></title>
	<meta charset="UTF-8">
</head>
<body>
	<h1><?=$main?></h1>
</body>
</html>